{
  "preguntas": [
    {
      "enunciado": "Tu aplicación está intentando subir un archivo de 6 GB a Simple Storage Service y recibe un mensaje de error 'Your proposed upload exceeds the maximum allowed object size.'. ¿Cuál es la posible solución?",
      "respuesta1": "Ninguno, los objetos de Simple Storage Service están limitados a 5 GB",
      "respuesta2": "Utilizar la API de carga multiparte para este objeto",
      "respuesta3": "Utilizar la API de carga de objetos grandes para este objeto",
      "respuesta4": "Póngase en contacto con el servicio de asistencia para aumentar el límite de tamaño de los objetos",
      "respuestaCorrecta": "2",
      "servicios": "S3"
    },
    {
      "enunciado": "Un desarrollador necesita acceso temporal a los recursos de una segunda cuenta. Cuál es la forma MÁS segura de conseguirlo?",
      "respuesta1": "Utiliza los grupos de usuarios de Amazon Cognito para obtener credenciales de corta duración para la segunda cuenta.",
      "respuesta2": "Cree una clave de acceso IAM dedicada para la segunda cuenta y envíela por correo.",
      "respuesta3": "Cree un rol de acceso entre cuentas y utilice sts:AssumeRole API para obtener credenciales de corta duración.",
      "respuesta4": "Establezca la confianza y añada una clave SSH para la segunda cuenta al usuario IAM.",
      "respuestaCorrecta": "3",
      "servicios": "IAM, security"
    },
    {
      "enunciado": "Se ha pedido a un desarrollador que realice cambios en el código fuente de una función de AWS Lambda. La función se administra mediante una plantilla de AWS CloudFormation. La plantilla está configurada para cargar el código fuente desde un bucket de Amazon S3. El desarrollador creó manualmente un paquete de despliegue de archivos .ZIP que contiene los cambios y colocó el archivo en la ubicación correcta en Amazon S3. Cuando se invoca la función, los cambios en el código no se han aplicado. ¿Qué paso es necesario para actualizar la función con los cambios?",
      "respuesta1": "Elimine el archivo .ZIP en S3 y vuelva a cargarlo utilizando un nombre de clave de objeto diferente.",
      "respuesta2": "Actualice la pila de CloudFormation con los valores correctos para las propiedades de código de función S3Bucket, S3Key o S3ObjectVersion.",
      "respuesta3": "Asegúrese de que el código fuente de la función está codificado en base64 antes de cargar el paquete de despliegue en S3.",
      "respuesta4": "Modificar el rol de ejecución de la función Lambda para permitir el permiso de acceso S3 al archivo .ZIP del paquete de despliegue.",
      "respuesta5": "",
      "respuesta6": "",
      "respuestaCorrecta": "2",
      "servicios": "Lambda, CloudFormation, S3"
    },
    {
      "enunciado": "Para una implementación con AWS CodeDeploy, ¿cuál es el orden de ejecución de los ganchos para las implementaciones in-place",
      "respuesta1": "Antes de la instalación -> Detención de la aplicación -> Inicio de la aplicación -> Después de la instalación",
      "respuesta2": "Parada de la aplicación -> Antes de instalar -> Después de instalar -> Inicio de la aplicación",
      "respuesta3": "Antes de instalar -> Detener aplicación -> Validar servicio -> Iniciar aplicación",
      "respuesta4": "Parada de la aplicación -> Antes de instalar -> Validar servicio -> Inicio de la aplicación",
      "respuesta5": "",
      "respuesta6": "",
      "respuestaCorrecta": "2",
      "servicios": "CodeDeploy, deployment"
    },
    {
      "enunciado": "Intenta almacenar un objeto en la región US-STANDARD en Amazon S3 y recibe una confirmación de que se ha almacenado correctamente. A continuación, realiza inmediatamente otra llamada a la API e intenta leer este objeto. S3 le dice que el objeto no existe. ¿Qué podría explicar este comportamiento?",
      "respuesta1": "US-STANDARD utiliza consistencia eventual y un objeto puede tardar en ser legible en un bucket",
      "respuesta2": "Los objetos en Amazon S3 no se hacen visibles hasta que se replican a una segunda región",
      "respuesta3": "US-STANDARD impone un retraso de 1 segundo antes de que los nuevos objetos sean legibles",
      "respuesta4": "Has superado el límite de objetos del cubo, y una vez que se aumente este límite el objeto será visible",
      "respuestaCorrecta": "1",
      "servicios": "S3, eventual consistency"
    },

    {
      "enunciado": "Un desarrollador está escribiendo una aplicación sin servidor que requiere que se invoque una función de AWS Lambda cada 10 minutos. ¿Cuál es una forma automatizada y sin servidor de activar la función?",
      "respuesta1": "Desplegar una instancia de Amazon EC2 basada en Linux, y editar su archivo /etc/crontab añadiendo un comando para invocar periódicamente la función Lambda",
      "respuesta2": "Configura una variable de entorno llamada PERIOD para la función Lambda. Establece el valor en 600",
      "respuesta3": "Crear una regla de Amazon CloudWatch Events que se active en una programación periódica para invocar la función Lambda",
      "respuesta4": "Crear un tema de Amazon SNS que tenga una suscripción a la función Lambda con un temporizador de 600 segundos",
      "respuestaCorrecta": "3",
      "servicios": "AWS Lambda, Amazon CloudWatch Events"
    },
    {
      "enunciado": "Una aplicación deja de funcionar con el siguiente error: El cubo especificado no existe. ¿Cuál es el MEJOR lugar para comenzar el análisis de la causa raíz?",
      "respuesta1": "Comprueba en los registros de Elastic Load Balancer si hay solicitudes DeleteBucket",
      "respuesta2": "Comprueba los registros de la aplicación en Amazon CloudWatch Logs en busca de errores de DeleteBucket de Amazon S3",
      "respuesta3": "Comprueba si hay alarmas de Amazon S3 DeleteBucket en AWS X-Ray",
      "respuesta4": "Comprobar AWS CloudTrail en busca de un evento DeleteBucket",
      "respuestaCorrecta": "4",
      "servicios": "Amazon S3, AWS CloudTrail, Elastic Load Balancer, Amazon CloudWatch Logs, AWS X-Ray"
    },
    {
      "enunciado": "Un desarrollador debe reimplementar la lógica de negocio para un sistema de cumplimiento de pedidos. La lógica de negocio tiene que hacer peticiones a múltiples vendedores para decidir dónde comprar un artículo. Todo el proceso puede tardar hasta una semana en completarse. ¿Cuál es la forma MÁS eficiente y SIMPLE de implementar un sistema que cumpla estos requisitos?",
      "respuesta1": "Utilizar AWS Step Functions para ejecutar funciones Lambda en paralelo, y unir los resultados",
      "respuesta2": "Crear un AWS SQS para cada proveedor, sondear la cola desde una instancia de trabajador y unir los resultados",
      "respuesta3": "Utilizar AWS Lambda para llamar de forma asíncrona a una función Lambda para cada proveedor, y unir los resultados",
      "respuesta4": "Utilizar Amazon CloudWatch Events para orquestar las funciones de Lambda",
      "respuestaCorrecta": "1",
      "servicios": "AWS Step Functions, AWS SQS, AWS Lambda, Amazon CloudWatch Events"
    },
    {
      "enunciado": "Una empresa tiene tres entornos diferentes: Desarrollo, QA y Producción. La compañía quiere desplegar su código primero en el entorno de Desarrollo, luego en QA y después en Producción. ¿Qué servicio de AWS se puede utilizar para cumplir este requisito?",
      "respuesta1": "Utilizar AWS CodeCommit para crear múltiples repositorios para desplegar la aplicación",
      "respuesta2": "Utilizar AWS CodeBuild para crear, configurar e implementar múltiples proyectos de compilación de la aplicación",
      "respuesta3": "Use AWS Data Pipeline to create multiple data pipeline provisions to deploy the application",
      "respuesta4": "Utilice AWS CodeDeploy para crear varios grupos de implementación",
      "respuestaCorrecta": "4",
      "servicios": "AWS CodeCommit, AWS CodeBuild, AWS Data Pipeline, AWS CodeDeploy"
    },
    {
      "enunciado": "¿Qué procedimientos desplegarán una función Lambda?",
      "respuesta1": "Subir el código a un repositorio de AWS CodeCommit, luego añadir una referencia a él en un recurso AWS::Lambda::Function en la plantilla",
      "respuesta2": "Crear un recurso AWS::Lambda::Function en la plantilla y, a continuación, escribir el código directamente dentro de la plantilla de CloudFormation",
      "respuesta3": "Sube un archivo .ZIP que contenga el código de la función a Amazon S3, luego añade una referencia a él en un recurso AWS::Lambda::Function en la plantilla",
      "respuesta4": "Subir un archivo .ZIP a AWS CloudFormation que contenga el código de la función y, a continuación, añadir una referencia a él en un recurso AWS::Lambda::Function en la plantilla",
      "respuestaCorrecta": "3",
      "servicios": "AWS Lambda y AWS CloudFormation"
    },
    {
      "enunciado": "Una aplicación lee datos de una tabla de Amazon DynamoDB. Varias veces al día, durante un periodo de 15 segundos, la aplicación recibe múltiples errores ProvisionedThroughputExceeded. ¿Cómo debe gestionarse esta excepción?",
      "respuesta1": "Crear un nuevo índice secundario global para la tabla que ayude con las peticiones adicionales",
      "respuesta2": "Reintentar las peticiones de lectura fallidas con backoff exponencial",
      "respuesta3": "Reintentar inmediatamente las peticiones de lectura fallidas",
      "respuesta4": "Utilizar la API 'UpdateItem' de DynamoDB para aumentar la capacidad de rendimiento provisionada de la tabla",
      "respuestaCorrecta": "2",
      "servicios": "Amazon DynamoDB"
    },

    {
      "enunciado": "¿Cómo puede un software determinar las direcciones IP pública y privada de la instancia de Amazon EC2 en la que se está ejecutando?",
      "respuesta1": "Consultar la métrica apropiada de Amazon CloudWatch",
      "respuesta2": "Utiliza el comando ipconfig o ifconfig",
      "respuesta3": "Consultar los datos de usuario de la instancia local",
      "respuesta4": "Consultar los metadatos de la instancia local",
      "respuestaCorrecta": "4",
      "servicios": "Amazon EC2"
    },
    {
      "enunciado": "¿Qué enfoque se debe utilizar para evitar afectar a los clientes existentes al desplegar una nueva versión de una API en Amazon API Gateway?",
      "respuesta1": "Actualizar la función Lambda subyacente y proporcionar a los clientes la nueva URL de invocación de Lambda",
      "respuesta2": "Utilizar API Gateway para propagar automáticamente el cambio a los clientes, especificando 180 días en el parámetro de despliegue por fases",
      "respuesta3": "Utilizar API Gateway para desplegar una nueva etapa denominada v2 en la API y proporcionar a los usuarios su URL",
      "respuesta4": "Actualizar la función Lambda subyacente, crear una distribución de Amazon CloudFront con la función Lambda actualizada como origen",
      "respuestaCorrecta": "3",
      "servicios": "Amazon API Gateway"
    },

    {
      "enunciado": "Un desarrollador está escribiendo una aplicación basada en Linux para ejecutarla en AWS Elastic Beanstalk. Los requisitos de la aplicación establecen que la aplicación debe mantener la capacidad completa durante las actualizaciones a la vez que se minimiza el coste. ¿Qué tipo de política de despliegue de Elastic Beanstalk debería especificar el desarrollador para el entorno?",
      "respuesta1": "Inmutable",
      "respuesta2": "Rolling",
      "respuesta3": "Todos a la vez",
      "respuesta4": "Rodando con lote adicional",
      "respuestaCorrecta": "4",
      "servicios": "AWS Elastic Beanstalk"
    },

    {
      "enunciado": "¿Cuál es el número máximo de Buckets S3 disponibles por cuenta AWS?",
      "respuesta1": "100 por región",
      "respuesta2": "no hay límite",
      "respuesta3": "100 por cuenta",
      "respuesta4": "500 por cuenta",
      "respuestaCorrecta": "3",
      "servicios": "Amazon S3"
    },
    {
      "enunciado": "Un desarrollador está escribiendo una aplicación móvil que permite a los usuarios ver imágenes desde un bucket S3. Los usuarios deben poder iniciar sesión con su login de Amazon, así como con sus cuentas de Facebook® y/o Google®. ¿Cómo puede el desarrollador proporcionar esta funcionalidad de autenticación?",
      "respuesta1": "Utilizar Amazon Cognito con federación de identidades web",
      "respuesta2": "Utilizar Amazon Cognito con federación de identidades basada en SAML",
      "respuesta3": "Utilizar claves AWS IAM Access/Secret en el código de la aplicación para permitir Get* en el bucket S3",
      "respuesta4": "Utilizar AWS STS AssumeRole en el código de la aplicación y asumir un rol con permisos Get* sobre el bucket S3",
      "respuestaCorrecta": "1",
      "servicios": "Cognito IAM"
    },
    {
      "enunciado": "Tras lanzar una instancia que pretende servir como dispositivo NAT (Network Address Translation) en una subred pública, modifica sus tablas de rutas para que el dispositivo NAT sea el destino del tráfico con destino a Internet de su subred privada. Cuando intenta realizar una conexión saliente a Internet desde una instancia de la subred privada, no lo consigue. ¿Cuál de los siguientes pasos podría resolver el problema?",
      "respuesta1": "Adjuntar una segunda interfaz de red elástica (ENI) a la instancia NAT y colocarla en la subred privada",
      "respuesta2": "Conectar una segunda interfaz de red elástica (ENI) a la instancia de la subred privada y colocarla en la subred pública",
      "respuesta3": "Deshabilitar el atributo Source/Destination Check en la instancia NAT",
      "respuesta4": "Adjuntar una dirección IP elástica a la instancia en la subred privada",
      "respuestaCorrecta": "3",
      "servicios": "Elastic"
    },
    {
      "enunciado": "Si se recupera un mensaje de una cola en Amazon SQS, ¿cuánto tiempo está inaccesible el mensaje para otros usuarios por defecto?",
      "respuesta1": "0 segundos",
      "respuesta2": "1 hora",
      "respuesta3": "para siempre",
      "respuesta4": "30 segundos",
      "respuestaCorrecta": "4",
      "servicios": "Amazon SQS"
    },

    {
      "enunciado": "Una empresa necesita un servicio de control de código fuente totalmente gestionado que funcione en AWS. El servicio debe garantizar que el control de revisiones sincronice múltiples repositorios distribuidos mediante el intercambio de conjuntos de cambios entre pares. Todos los usuarios necesitan trabajar de forma productiva incluso cuando no están conectados a una red",
      "respuesta1": "Subversion",
      "respuesta2": "AWS CodeBuild",
      "respuesta3": "AWS CodeCommit",
      "respuesta4": "AWS CodeStar",
      "respuestaCorrecta": "3",
      "servicios": "CodeCommit"
    },
    {
      "enunciado": "Un desarrollador ha publicado una actualización de una aplicación que se sirve a una base de usuarios global mediante Amazon CloudFront. Después de desplegar la aplicación, los usuarios no pueden ver los cambios actualizados",
      "respuesta1": "Eliminar el origen de la configuración de CloudFront y añadirlo de nuevo",
      "respuesta2": "Deshabilitar el reenvío de cadenas de consulta y cabeceras de solicitud desde la configuración de distribución de CloudFront",
      "respuesta3": "Invalidar todos los objetos de solicitud de las cachés de borde",
      "respuesta4": "Deshabilitar la distribución de CloudFront y habilitarla de nuevo para actualizar todas las ubicaciones de borde",
      "respuestaCorrecta": "3",
      "servicios": "CloudFront"
    },
    {
      "enunciado": "La empresaC aloja actualmente su sitio corporativo en un bucket de Amazon S3 con el alojamiento de sitios web estáticos habilitado. Actualmente, cuando los visitantes van a http://www.companyc.com se devuelve la página index.html. La empresa C desea ahora que se devuelva una nueva página welcome.html cuando un visitante entra en http://www.companyc.com en el navegador",
      "respuesta1": "Subir una página html llamada welcome.html a su bucket de S3",
      "respuesta2": "Crear una subcarpeta welcome en su bucket de S3",
      "respuesta3": "Establecer la propiedad Index Document a welcome.html",
      "respuesta4": "Mover la página index.html a una subcarpeta de bienvenida",
      "respuestaCorrecta": "1",
      "servicios": "Amazon S3"
    }
  ]
}
